Repository: shizopudge/word-pronunciation
Catalog: lib/src/core/l10n/app_*.arb
Languages: ru

# appInitializationStart
source: App initialization starting
ru: Начало инициализации приложения

# appInitializationAppConnect
source: Checking connection
ru: Проверка подключения

# appInitializationDB
source: Initializing the local database
ru: Инициализация локальной базы данных

# appInitializationEnd
source: App initialization finished
ru: Инициализация приложения завершена

source: Error
ru: Ошибка

source: Restart
ru: Перезагрузить

# unknownErrorOccurred
source: An unknown error occurred
ru: Произошла неизвестная ошибка

# coreInitializationError
source: An error occurred while initializing the application core
ru: Произошла ошибка во время инициализации основы приложения

# appInitializationError
source: An error occurred while initializing the application. Progress: {initializationProgress}
ru: Произошла ошибка во время инициализации приложения. Прогресс: {initializationProgress}

# timeoutError
source: Wait time exceeded
ru: Превышено время ожидания

# checkInternetConnection
source: Check your internet connection!
ru: Проверьте подключение к интернету!

source: Word was not received
ru: Слово не было получено

source: Example
ru: Пример

source: Start pronunciation
ru: Начать произношение

source: Verb Definitions
ru: Определения-глаголы

source: Noun Definitions
ru: Определения-существительные

source: Unknown license
ru: Неизвестная лицензия

source: Phonetics
ru: Фонетика

source: Word
ru: Слово

source: Try again
ru: Попробовать снова

source: Next word
ru: Следующее слово

# audioServiceError
source: An error occurred while trying to play an audio file
ru: Во время попытки проиграть аудио файл произошла ошибка

source: Connection time out
ru: Время соединения вышло

# sendTimeout
source: Sending time has expired
ru: Время отправки вышло

# receiveTimeout
source: Receipt time has expired
ru: Время получения вышло

# badCertificate
source: Incorrect Certificate
ru: Неверный сертификат

source: Bad response
ru: Что-то пошло не так

# requestCancel
source: Request canceled
ru: Запрос отменен

source: Connection error
ru: Ошибка подключения

source: Unknown network error
ru: Неизвестная ошибка сети

source: Definition
ru: Определение

# openAppSettings
source: Open application settings
ru: Открыть настройки приложения

source: Microphone permissions
ru: Разрешения на использование микрофона

# youHaventGivenPermissionToUseMic
source: You have not given permission to use the microphone
ru: Вы не дали разрешения на использование микрофона

source: Can't open app settings
ru: Не получается открыть настройки приложения

# speechServiceError
source: An error occurred while trying to recognize a spoken word
ru: Во время попытки распознать произносимое слово произошла ошибка

# errorNoMatch
source: No matches found for spoken word
ru: Не найдено совпадений по произнесенному слову

# errorSpeechTimeout
source: Pronunciation timed out
ru: Превышено время ожидания произношения

# speechServicePermissionError
source: There was an error with the permissions for the pronunciation service
ru: Произошла ошибка с разрешениями для сервиса произношения

source: History
ru: История

# historyFatalError
source: There was an error loading history
ru: Произошла ошибка при загрузке истории

source: History is empty
ru: История пуста

source: History filter
ru: Фильтр истории

source: All
ru: Все

source: Pronounced
ru: Произнесенные

source: Pronounced incorrect
ru: Произнесенные неправильно

source: Apply filter
ru: Применить фильтр

# errorSpeechNetwork
source: An error occurred with the Internet connection during pronunciation
ru: Произошла ошибка с интернет соединением во время произношения

source: Up
ru: Вверх
